### Rapid Overview
- build intuition about pandas
- details later

documentation: http://pandas.pydata.org/pandas-docs/stable/10min.html

In [1]:
import pandas as pd
import numpy as np

##### Basic series; default integer index
documentation: http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.html

In [2]:
my_series = pd.Series([1,3,5,np.nan,6,8])
my_series

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

##### datetime index
documentation: http://pandas.pydata.org/pandas-docs/stable/timeseries.html

In [3]:
my_dates_index = pd.date_range('20160101', periods=6)
my_dates_index

DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
               '2016-01-05', '2016-01-06'],
              dtype='datetime64[ns]', freq='D')

##### sample NumPy data

In [5]:
sample_numpy_data = np.array(np.arange(24)).reshape(6,4)
sample_numpy_data

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [20, 21, 22, 23]])

##### sample data frame, with column headers; uses our dates_index
documentation: http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html

In [7]:
sample_df = pd.DataFrame(sample_numpy_data, index=my_dates_index, columns=list('ABCD'))
sample_df

             A   B   C   D
2016-01-01   0   1   2   3
2016-01-02   4   5   6   7
2016-01-03   8   9  10  11
2016-01-04  12  13  14  15
2016-01-05  16  17  18  19
2016-01-06  20  21  22  23

##### data frame from a Python dictionary

In [9]:
df_from_dictionary = pd.DataFrame({ 
                         'float' : 1.,
                         'time' : pd.Timestamp('20160825'),
                         'series' : pd.Series(1,index=list(range(4)),dtype='float32'),
                         'array' : np.array([3] * 4,dtype='int32'),
                         'categories' : pd.Categorical(["test","train","taxes","tools"]),
                         'dull' : 'boring data' 
                      })
df_from_dictionary

   float       time  series  array categories         dull
0    1.0 2016-08-25     1.0      3       test  boring data
1    1.0 2016-08-25     1.0      3      train  boring data
2    1.0 2016-08-25     1.0      3      taxes  boring data
3    1.0 2016-08-25     1.0      3      tools  boring data

##### pandas retains data type for each column

In [15]:
df_from_dictionary.dtypes

float                float64
time          datetime64[ns]
series               float32
array                  int32
categories          category
dull                  object
dtype: object

##### head and tail; default is 5 rows

In [18]:
sample_df.tail(2)

             A   B   C   D
2016-01-05  16  17  18  19
2016-01-06  20  21  22  23

In [20]:
sample_df.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [20, 21, 22, 23]])

##### underlying data: values, index and columns

In [21]:
sample_df.index

DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
               '2016-01-05', '2016-01-06'],
              dtype='datetime64[ns]', freq='D')

In [22]:
sample_df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [25]:
sample_df.describe

<bound method NDFrame.describe of              A   B   C   D
2016-01-01   0   1   2   3
2016-01-02   4   5   6   7
2016-01-03   8   9  10  11
2016-01-04  12  13  14  15
2016-01-05  16  17  18  19
2016-01-06  20  21  22  23>

In [26]:
sample_df.describe(percentiles=[0, 0.2, 0.5, 0.6, 0.9, 1])

               A          B          C          D
count   6.000000   6.000000   6.000000   6.000000
mean   10.000000  11.000000  12.000000  13.000000
std     7.483315   7.483315   7.483315   7.483315
min     0.000000   1.000000   2.000000   3.000000
0%      0.000000   1.000000   2.000000   3.000000
20%     4.000000   5.000000   6.000000   7.000000
50%    10.000000  11.000000  12.000000  13.000000
60%    12.000000  13.000000  14.000000  15.000000
90%    18.000000  19.000000  20.000000  21.000000
100%   20.000000  21.000000  22.000000  23.000000
max    20.000000  21.000000  22.000000  23.000000

##### describe(): a quick statistical summary
- notice: integer data summarized with floating point numbers

In [27]:
pd.set_option('display.precision', 3)

##### control precision of floating point numbers
for options and settings, please see: http://pandas.pydata.org/pandas-docs/stable/generated/pandas.set_option.html

In [28]:
sample_df.describe()

            A       B       C       D
count   6.000   6.000   6.000   6.000
mean   10.000  11.000  12.000  13.000
std     7.483   7.483   7.483   7.483
min     0.000   1.000   2.000   3.000
25%     5.000   6.000   7.000   8.000
50%    10.000  11.000  12.000  13.000
75%    15.000  16.000  17.000  18.000
max    20.000  21.000  22.000  23.000

##### transpose rows and columns

In [29]:
sample_df.T

   2016-01-01  2016-01-02  2016-01-03  2016-01-04  2016-01-05  2016-01-06
A           0           4           8          12          16          20
B           1           5           9          13          17          21
C           2           6          10          14          18          22
D           3           7          11          15          19          23

##### sort by axis

In [30]:
sample_df.sort_index(axis=1, ascending=False)

             D   C   B   A
2016-01-01   3   2   1   0
2016-01-02   7   6   5   4
2016-01-03  11  10   9   8
2016-01-04  15  14  13  12
2016-01-05  19  18  17  16
2016-01-06  23  22  21  20

In [35]:
sample_df.sort_values(by='A', ascending=False)

             A   B   C   D
2016-01-06  20  21  22  23
2016-01-05  16  17  18  19
2016-01-04  12  13  14  15
2016-01-03   8   9  10  11
2016-01-02   4   5   6   7
2016-01-01   0   1   2   3

##### sort by data within a column (our data was already sorted)